app/views/papers/show.html.erb

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."template_id" = ?  [["template_id", 1]]
---

<% @paper.template.sections.each do |section| %>