app/controllers/contents_controller.rb

SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "contents".* FROM "contents" WHERE (paper_id = 1 and field_id in (select distinct section_id from fields where section_id = 1))
SELECT COUNT(*) FROM "contents" WHERE (paper_id = 1 and field_id in (select distinct section_id from fields where section_id = 1))
INSERT INTO "contents" ("paper_id", "field_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["paper_id", 1], ["field_id", 1], ["created_at", "2017-08-20 15:50:27.465365"], ["updated_at", "2017-08-20 15:50:27.465365"]]
---
  def edit
  	@paper = Paper.find(params[:paper_id])
  	@fields = Field.where("section_id = #{params[:section_id]}")
  	@contents = Content.where("paper_id = #{@paper.id} and field_id in (select distinct id from fields where section_id = #{params[:section_id]})")
  	if @contents.empty?
  		@fields.each do |field|
  			c = Content.new
  			c.paper = paper
  			c.field = field
  			c.save

SELECT  "contents".* FROM "contents" WHERE (paper_id = 1 and field_id = 1) ORDER BY "contents"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "contents" SET "content" = ?, "updated_at" = ? WHERE "contents"."id" = ?  [["content", "my content"], ["updated_at", "2017-08-20 17:37:29.365892"], ["id", 1]]
---
  def update
  	fields = params[:field_id]
  	puts fields.inspect
  	papers = params[:paper_id]
  	puts papers.inspect
  	contents = params[:content]
  	puts contents.inspect
  	contents.zip(papers, fields) do |c, p, f|
  		content = Content.where("paper_id = #{p} and field_id = #{f}").first
  		content.update({:paper_id => p, :field_id => f, :content => c})

SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."template_id" = ?  [["template_id", 1]]
SELECT "fields".* FROM "fields" WHERE "fields"."section_id" = ?  [["section_id", 1]]
SELECT  "contents".* FROM "contents" WHERE (paper_id = 1 and field_id = 1) ORDER BY "contents"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def build
    @tex = ""
    @paper = Paper.find(params[:id])
    @paper.template.sections.each do |section|
      section.fields.each do |field|
        content = Content.where("paper_id = #{@paper.id} and field_id = #{field.id}").first