app/controllers/fields_controller.rb

  def index
    @fields = Field.from_section(@section.id).paginate(:page => params[:page], :per_page => 10)
---
SELECT `fields`.* FROM `fields`

  def create
    @count = @count + 1
    @field = Field.new(field_params)

    respond_to do |format|
      if @field.save
---
INSERT INTO `fields` (`name`, `label`, `open_tag`, `close_tag`, `section_id`, `created_at`, `updated_at`) VALUES ('teste', '', '', '', 1, '2017-09-22 23:46:28', '2017-09-22 23:46:28')

  def update
    respond_to do |format|
      if @field.update(field_params)
---
UPDATE "fields" SET "open_tag" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["open_tag", "\\documentclass{article}\\begin{document}"], ["updated_at", "2017-08-20 19:45:39.816711"], ["id", 1]]

  def destroy
    if @field.destroy
---
DELETE FROM `fields` WHERE `fields`.`id` = 2

    def set_field
      @field = Field.find(params[:id])
---
SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_section
      @section = Section.find(params[:section_id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]