app/controllers/papers_controller.rb

  def index
    @papers = Paper.from_user(current_user.id).paginate(:page => params[:page], :per_page => 10)
---
SELECT `papers`.* FROM `papers`

  def create
    @paper = Paper.new(paper_params)

    respond_to do |format|
      if @paper.save
---
INSERT INTO "papers" ("name", "template_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Novo artigo"], ["template_id", 1], ["user_id", 1], ["created_at", "2017-08-20 15:32:11.399528"], ["updated_at", "2017-08-20 15:32:11.399528"]]

    def set_paper
      @paper = Paper.find(params[:id])
---
SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]