app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections`
---
  def index
    @sections = Section.from_template(@template.id).paginate(:page => params[:page], :per_page => 10)

INSERT INTO "sections" ("name", "template_id", "is_editable", "is_wysiwyg", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Header"], ["template_id", 2], ["is_editable", "t"], ["is_wysiwyg", "f"], ["position", 1], ["created_at", "2017-08-20 19:50:27.662942"], ["updated_at", "2017-08-20 19:50:27.662942"]]
---
  def create
    @count = @count + 1
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

UPDATE "sections" SET "position" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["position", 1], ["updated_at", "2017-08-20 19:45:03.960521"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @section.update(section_params)

DELETE FROM `sections` WHERE `sections`.`id` = 2
---
  def destroy
    if @section.destroy

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_template
      @template = Template.find(params[:template_id])