app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT `templates`.* FROM `templates`

  def create
    @template = Template.new(template_params)

    respond_to do |format|
      if @template.save
---
INSERT INTO "templates" ("name", "description", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Basic"], ["description", "Basic template with title and author"], ["is_active", "t"], ["created_at", "2017-08-20 19:50:02.286316"], ["updated_at", "2017-08-20 19:50:02.286316"]]

  def update
    respond_to do |format|
      if @template.update(template_params)
---
UPDATE "templates" SET "description" = ?, "is_active" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["description", "This is a basic description"], ["is_active", "t"], ["updated_at", "2017-08-20 19:49:19.156810"], ["id", 1]]

    def set_template
      @template = Template.find(params[:id])
---
SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]