app/controllers/users_controller.rb

  def index
    @users = User.all.paginate(:page => params[:page], :per_page => 10)
---
SELECT `users`.* FROM `users`